Merge pull request #3 from judedcunha/production_features
Production features and Unit Tests
